<template>
  <v-navigation-drawer :width="300">
    <h1 class="text-center">規則書</h1>
    <v-list>
      <v-list-group value="開始">
        <template #activator="{ props }">
          <v-list-item class="text-center" v-bind="props" title="開始"></v-list-item>
        </template>
        <v-list-item class="text-center" link to="#start-aaaa" title="AAAA"></v-list-item>
        <v-list-item class="text-center" link to="#start-bbbb" title="BBBB"></v-list-item>
      </v-list-group>

      <!-- 有子選單的選項 -->
      <v-list-group value="玩家">
        <template #activator="{ props }">
          <v-list-item class="text-center" v-bind="props" title="玩家"></v-list-item>
        </template>
        <v-list-item class="text-center" link to="#player-cccc" title="CCCC"></v-list-item>
        <v-list-item class="text-center" link to="#player-dddd" title="DDDD"></v-list-item>
      </v-list-group>

      <v-list-group value="主持人">
        <template #activator="{ props }">
          <v-list-item class="text-center" v-bind="props" title="主持人"></v-list-item>
        </template>
        <v-list-item class="text-center" link to="#host-eeee" title="EEEE"></v-list-item>
        <v-list-item class="text-center" link to="#host-ffff" title="FFFF"></v-list-item>
      </v-list-group>
    </v-list>
  </v-navigation-drawer>

  <v-container width="90%">
    <h1>導言</h1>
    <v-card-title id="start">開始</v-card-title>
    <v-card>
      <v-card-item>
        <v-card-title id="start-aaaa">開始-aaaa</v-card-title>
        <v-card-text>
          ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
        </v-card-text>
        <v-card-title id="start-bbbb">開始-bbbb</v-card-title>
        <v-card-text>
          ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
        </v-card-text>
      </v-card-item>
    </v-card>
    <v-card-title id="player">玩家</v-card-title>
    <v-card>
      <v-card-item>
        <v-card-title id="player-cccc">玩家-cccc</v-card-title>
        <v-card-text>
          ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
        </v-card-text>
      </v-card-item>
    </v-card>

    <v-card>
      <v-card-item>
        <v-card-title id="player-dddd">玩家-dddd</v-card-title>
        <v-card-text>
          ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
        </v-card-text>
      </v-card-item>
    </v-card>
    <v-card-title id="host">主持人</v-card-title>
    <v-card>
      <v-card-item>
        <v-card-title id="host-eeee">主持人-eeee</v-card-title>
        <v-card-text>
          ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
        </v-card-text>
      </v-card-item>
    </v-card>

    <v-card>
      <v-card-item>
        <v-card-title id="host-ffff">主持人-ffff</v-card-title>
        <v-card-text>
          ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
        </v-card-text>
      </v-card-item>
    </v-card>
  </v-container>
</template>

<style>
.v-list-item__prepend > .v-badge .v-icon,
.v-list-item__prepend > .v-icon,
.v-list-item__append > .v-badge .v-icon,
.v-list-item__append > .v-icon {
  opacity: 0;
}

.v-list-item--active .v-list-item__prepend > .v-badge .v-icon,
.v-list-item--active .v-list-item__prepend > .v-icon,
.v-list-item--active .v-list-item__append > .v-badge .v-icon,
.v-list-item--active .v-list-item__append > .v-icon {
  opacity: 0;
}
</style>

<route lang="yaml">
meta:
  title: '規則書'
</route>
